pmo-dataset/mermaid/42.mmd
graph LR
	classDef endEvent stroke-width:4px
	
	User_2["Rate Service\nFacility"] --> EndNoneEvent_1(("Repair process over")):::endEvent
	Manual_1["Confirm that fridge\nis okay"] --> ExclusiveGateway_1{"Submit a rating?"}
	User_1["Send a report to the\nfridge service\ncenter"] --> Service_2["Select local service\nfacility"]
	Service_1["Schedule an\nappointment for\nfridge repair"] --> IntermediateTimerEvent_1(("Wait until service\nfacility arrives"))
	IntermediateTimerEvent_1 --> Manual_2["Repair the fridge"]
	Manual_2 --> ExclusiveGateway_2{"Additional parts\nneeded?"}
	Service_2 --> ExclusiveGateway_3{"X"}
	ExclusiveGateway_3 --> Service_1
	ParallelGateway_1{"+"} --> User_3["Describe the\nsymptoms"]
	ParallelGateway_1 --> Manual_3["Collect fridge type\ndata"]
	ExclusiveGateway_2 -->|"No. Fridge is\nrepaired"| Manual_1
	ExclusiveGateway_1 -->|"Yes"| User_2
	Manual_3 --> ParallelGateway_2{"+"}
	ParallelGateway_2 --> User_1
	User_3 --> ParallelGateway_2
	StartNoneEvent_1(("Fridge makes strange\nnoises")) --> ParallelGateway_1
	ExclusiveGateway_1 -->|"No"| EndNoneEvent_1
	ExclusiveGateway_2 -->|"Yes. Fridge is not\nrepaired"| ExclusiveGateway_3
